import java.util.Scanner;

public class exercise114 {
	 public static void main(String[] args) {
		 		/*
		 		 * Реализуйте метод, осуществляющий сжатие строки на основе счетчика
		 		 * повторяющихся символов. Например, строка aaabbcccc должна превратиться в
		 		 * a3b2c5. Если сжатая строка оказалась длиннее исходной, то результатом работы
		 		 * алгоритма должна быть исходная строка. Решить задачу с предположением, что в
		 		 * исходной строке нет цифр. Решить задачи для произвольной строки.
		 		 */	
		 		Scanner sc = new Scanner(System.in);
		 		System.out.println("Введите свою строку:");
		 		String str1 = sc.nextLine();
		 	}
		 }
	 }
}
